ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_touch.c
    /* touch_data_hystersis */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_TOUCH_DATA_HYSTERSIS);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_DATA_HYS, tCfg->dataHysCtrl);
    tmpVal = BL_WR_REG(PDS_BASE, PDS_TOUCH_DATA_HYSTERSIS, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  touch moudle channel init
 *
 * @param  touchId: touch moudle ID
 * @param  tChCfg: touch moudle channel config
 * @param  tChSel: touch moudle channel select
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type TOUCH_CHANNEL_Init(TOUCH_ID_Type touchId, TOUCH_CHANNEL_CFG_Type *tChCfg, TOUCH_CHANNEL_Type tChSel)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_TOUCH_ID_TYPE(touchId));
    CHECK_PARAM(IS_TOUCH_CHANNEL_HIGHZ_CFG_TYPE(tChCfg->ch0));
    CHECK_PARAM(IS_TOUCH_CHANNEL_HIGHZ_CFG_TYPE(tChCfg->ch1));
    CHECK_PARAM(IS_TOUCH_CHANNEL_HIGHZ_CFG_TYPE(tChCfg->ch2));
    CHECK_PARAM(IS_TOUCH_CHANNEL_HIGHZ_CFG_TYPE(tChCfg->ch3));
    CHECK_PARAM(IS_TOUCH_CHANNEL_HIGHZ_CFG_TYPE(tChCfg->ch4));
    CHECK_PARAM(IS_TOUCH_CHANNEL_HIGHZ_CFG_TYPE(tChCfg->ch5));
    CHECK_PARAM(IS_TOUCH_CHANNEL_HIGHZ_CFG_TYPE(tChCfg->ch6));
    CHECK_PARAM(IS_TOUCH_CHANNEL_HIGHZ_CFG_TYPE(tChCfg->ch7));
    CHECK_PARAM(IS_TOUCH_CHANNEL_HIGHZ_CFG_TYPE(tChCfg->ch8));
    CHECK_PARAM(IS_TOUCH_CHANNEL_HIGHZ_CFG_TYPE(tChCfg->ch9));
    CHECK_PARAM(IS_TOUCH_CHANNEL_HIGHZ_CFG_TYPE(tChCfg->ch10));
    CHECK_PARAM(IS_TOUCH_CHANNEL_HIGHZ_CFG_TYPE(tChCfg->ch11));
    CHECK_PARAM(IS_TOUCH_CHANNEL_TYPE(tChSel));

    /* touch2 */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_TOUCH2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_CHANNEL11_HIGHZ_EN, tChCfg->ch11);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_CHANNEL10_HIGHZ_EN, tChCfg->ch10);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_CHANNEL9_HIGHZ_EN, tChCfg->ch9);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_CHANNEL8_HIGHZ_EN, tChCfg->ch8);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_CHANNEL7_HIGHZ_EN, tChCfg->ch7);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_CHANNEL6_HIGHZ_EN, tChCfg->ch6);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_CHANNEL5_HIGHZ_EN, tChCfg->ch5);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_CHANNEL4_HIGHZ_EN, tChCfg->ch4);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_CHANNEL3_HIGHZ_EN, tChCfg->ch3);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_CHANNEL2_HIGHZ_EN, tChCfg->ch2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_CHANNEL1_HIGHZ_EN, tChCfg->ch1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_CHANNEL0_HIGHZ_EN, tChCfg->ch0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_CHANNEL_SEL, tChSel);
    tmpVal = BL_WR_REG(PDS_BASE, PDS_TOUCH2, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  touch moudle start
 *
 * @param  touchId: touch moudle ID
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type TOUCH_Enable(TOUCH_ID_Type touchId)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_TOUCH_ID_TYPE(touchId));

    /* touch1 */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_TOUCH1);
    tmpVal = BL_SET_REG_BIT(tmpVal, PDS_PU_TOUCH);
    tmpVal = BL_WR_REG(PDS_BASE, PDS_TOUCH1, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  touch moudle stop
 *
 * @param  touchId: touch moudle ID
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type TOUCH_Disable(TOUCH_ID_Type touchId)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_TOUCH_ID_TYPE(touchId));

    /* touch1 */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_TOUCH1);
    tmpVal = BL_CLR_REG_BIT(tmpVal, PDS_PU_TOUCH);
    tmpVal = BL_WR_REG(PDS_BASE, PDS_TOUCH1, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  touch moudle set V threshold  value
 *
 * @param  touchId: touch moudle ID
 * @param  tCh: touch moudle channel
 * @param  value: vth value
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type TOUCH_SetVthData(TOUCH_ID_Type touchId, TOUCH_CHANNEL_Type tCh, uint8_t value)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_TOUCH_ID_TYPE(touchId));
    CHECK_PARAM(IS_TOUCH_CHANNEL_TYPE(tCh));

    if (tCh <= TOUCH_CHANNEL_3) {
        /* channel 0 - channel 3 */
        tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_VTH_DATA_0);

        switch (tCh) {
            case TOUCH_CHANNEL_0:
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_VTH_DATA_CH0, value);
                break;

            case TOUCH_CHANNEL_1:
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_VTH_DATA_CH1, value);
                break;

            case TOUCH_CHANNEL_2:
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_VTH_DATA_CH2, value);
                break;

            case TOUCH_CHANNEL_3:
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_VTH_DATA_CH3, value);
                break;

            default:
                break;
        }

        tmpVal = BL_WR_REG(PDS_BASE, PDS_CHANNEL_VTH_DATA_0, tmpVal);
    } else if (tCh <= TOUCH_CHANNEL_7) {
        /* channel 4 - channel 7 */
        tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_VTH_DATA_1);

        switch (tCh) {
            case TOUCH_CHANNEL_4:
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_VTH_DATA_CH4, value);
                break;

            case TOUCH_CHANNEL_5:
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_VTH_DATA_CH5, value);
                break;

            case TOUCH_CHANNEL_6:
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_VTH_DATA_CH6, value);
                break;

            case TOUCH_CHANNEL_7:
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_VTH_DATA_CH7, value);
                break;

            default:
                break;
        }

