ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_touch.c
        tmpVal = BL_WR_REG(PDS_BASE, PDS_CHANNEL_VTH_DATA_1, tmpVal);
    } else {
        /* channel 8 - channel 11 */
        tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_VTH_DATA_2);

        switch (tCh) {
            case TOUCH_CHANNEL_8:
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_VTH_DATA_CH8, value);
                break;

            case TOUCH_CHANNEL_9:
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_VTH_DATA_CH9, value);
                break;

            case TOUCH_CHANNEL_10:
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_VTH_DATA_CH10, value);
                break;

            case TOUCH_CHANNEL_11:
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_VTH_DATA_CH11, value);
                break;

            default:
                break;
        }

        tmpVal = BL_WR_REG(PDS_BASE, PDS_CHANNEL_VTH_DATA_2, tmpVal);
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  get touch moudle vth data
 *
 * @param  touchId: touch moudle ID
 * @param  tCh: touch moudle channel
 *
 * @return vth data
 *
*******************************************************************************/
uint32_t TOUCH_GetVthData(TOUCH_ID_Type touchId, TOUCH_CHANNEL_Type tCh)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_TOUCH_ID_TYPE(touchId));
    CHECK_PARAM(IS_TOUCH_CHANNEL_TYPE(tCh));

    if (tCh <= TOUCH_CHANNEL_3) {
        /* channel 0 - channel 3 */
        tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_VTH_DATA_0);

        switch (tCh) {
            case TOUCH_CHANNEL_0:
                tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_VTH_DATA_CH0);
                break;

            case TOUCH_CHANNEL_1:
                tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_VTH_DATA_CH1);
                break;

            case TOUCH_CHANNEL_2:
                tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_VTH_DATA_CH2);
                break;

            case TOUCH_CHANNEL_3:
                tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_VTH_DATA_CH3);
                break;

            default:
                break;
        }
    } else if (tCh <= TOUCH_CHANNEL_7) {
        /* channel 4 - channel 7 */
        tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_VTH_DATA_1);

        switch (tCh) {
            case TOUCH_CHANNEL_4:
                tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_VTH_DATA_CH4);
                break;

            case TOUCH_CHANNEL_5:
                tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_VTH_DATA_CH5);
                break;

            case TOUCH_CHANNEL_6:
                tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_VTH_DATA_CH6);
                break;

            case TOUCH_CHANNEL_7:
                tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_VTH_DATA_CH7);
                break;

            default:
                break;
        }
    } else {
        /* channel 8 - channel 11 */
        tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_VTH_DATA_2);

        switch (tCh) {
            case TOUCH_CHANNEL_8:
                tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_VTH_DATA_CH8);
                break;

            case TOUCH_CHANNEL_9:
                tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_VTH_DATA_CH9);
                break;

            case TOUCH_CHANNEL_10:
                tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_VTH_DATA_CH10);
                break;

            case TOUCH_CHANNEL_11:
                tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_VTH_DATA_CH11);
                break;

            default:
                break;
        }
    }

    return tmpVal;
}

/****************************************************************************/ /**
 * @brief  get touch moudle raw data
 *
 * @param  touchId: touch moudle ID
 * @param  tCh: touch moudle channel
 *
 * @return raw data
 *
*******************************************************************************/
uint32_t TOUCH_GetRawData(TOUCH_ID_Type touchId, TOUCH_CHANNEL_Type tCh)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_TOUCH_ID_TYPE(touchId));
    CHECK_PARAM(IS_TOUCH_CHANNEL_TYPE(tCh));

    switch (tCh) {
        case TOUCH_CHANNEL_0:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_RAW_DATA_0);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_RAW_DATA_CH0);
            break;

        case TOUCH_CHANNEL_1:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_RAW_DATA_1);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_RAW_DATA_CH1);
            break;

        case TOUCH_CHANNEL_2:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_RAW_DATA_2);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_RAW_DATA_CH2);
            break;

        case TOUCH_CHANNEL_3:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_RAW_DATA_3);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_RAW_DATA_CH3);
            break;

        case TOUCH_CHANNEL_4:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_RAW_DATA_4);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_RAW_DATA_CH4);
            break;

        case TOUCH_CHANNEL_5:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_RAW_DATA_5);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_RAW_DATA_CH5);
            break;

        case TOUCH_CHANNEL_6:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_RAW_DATA_6);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_RAW_DATA_CH6);
            break;

        case TOUCH_CHANNEL_7:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_RAW_DATA_7);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_RAW_DATA_CH7);
            break;

        case TOUCH_CHANNEL_8:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_RAW_DATA_8);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_RAW_DATA_CH8);
            break;

