ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_touch.c
        case TOUCH_CHANNEL_9:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_RAW_DATA_9);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_RAW_DATA_CH9);
            break;

        case TOUCH_CHANNEL_10:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_RAW_DATA_10);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_RAW_DATA_CH10);
            break;

        case TOUCH_CHANNEL_11:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_RAW_DATA_11);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_RAW_DATA_CH11);
            break;
    }

    return tmpVal;
}

/****************************************************************************/ /**
 * @brief  get touch moudle LTA data
 *
 * @param  touchId: touch moudle ID
 * @param  tCh: touch moudle channel
 *
 * @return LTA data
 *
*******************************************************************************/
uint32_t TOUCH_GetLtaData(TOUCH_ID_Type touchId, TOUCH_CHANNEL_Type tCh)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_TOUCH_ID_TYPE(touchId));
    CHECK_PARAM(IS_TOUCH_CHANNEL_TYPE(tCh));

    switch (tCh) {
        case TOUCH_CHANNEL_0:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_LTA_DATA_0);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_LTA_DATA_CH0);
            break;

        case TOUCH_CHANNEL_1:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_LTA_DATA_1);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_LTA_DATA_CH1);
            break;

        case TOUCH_CHANNEL_2:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_LTA_DATA_2);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_LTA_DATA_CH2);
            break;

        case TOUCH_CHANNEL_3:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_LTA_DATA_3);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_LTA_DATA_CH3);
            break;

        case TOUCH_CHANNEL_4:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_LTA_DATA_4);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_LTA_DATA_CH4);
            break;

        case TOUCH_CHANNEL_5:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_LTA_DATA_5);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_LTA_DATA_CH5);
            break;

        case TOUCH_CHANNEL_6:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_LTA_DATA_6);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_LTA_DATA_CH6);
            break;

        case TOUCH_CHANNEL_7:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_LTA_DATA_7);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_LTA_DATA_CH7);
            break;

        case TOUCH_CHANNEL_8:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_LTA_DATA_8);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_LTA_DATA_CH8);
            break;

        case TOUCH_CHANNEL_9:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_LTA_DATA_9);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_LTA_DATA_CH9);
            break;

        case TOUCH_CHANNEL_10:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_LTA_DATA_10);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_LTA_DATA_CH10);
            break;

        case TOUCH_CHANNEL_11:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_LTA_DATA_11);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_LTA_DATA_CH11);
            break;
    }

    return tmpVal;
}

/****************************************************************************/ /**
 * @brief  get touch moudle FLT data
 *
 * @param  touchId: touch moudle ID
 * @param  tCh: touch moudle channel
 *
 * @return FLT data
 *
*******************************************************************************/
uint32_t TOUCH_GetFltData(TOUCH_ID_Type touchId, TOUCH_CHANNEL_Type tCh)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_TOUCH_ID_TYPE(touchId));
    CHECK_PARAM(IS_TOUCH_CHANNEL_TYPE(tCh));

    switch (tCh) {
        case TOUCH_CHANNEL_0:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_FLT_DATA_0);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_FLT_DATA_CH0);
            break;

        case TOUCH_CHANNEL_1:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_FLT_DATA_1);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_FLT_DATA_CH1);
            break;

        case TOUCH_CHANNEL_2:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_FLT_DATA_2);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_FLT_DATA_CH2);
            break;

        case TOUCH_CHANNEL_3:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_FLT_DATA_3);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_FLT_DATA_CH3);
            break;

        case TOUCH_CHANNEL_4:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_FLT_DATA_4);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_FLT_DATA_CH4);
            break;

        case TOUCH_CHANNEL_5:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_FLT_DATA_5);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_FLT_DATA_CH5);
            break;

        case TOUCH_CHANNEL_6:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_FLT_DATA_6);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_FLT_DATA_CH6);
            break;

        case TOUCH_CHANNEL_7:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_FLT_DATA_7);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_FLT_DATA_CH7);
            break;

        case TOUCH_CHANNEL_8:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_FLT_DATA_8);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_FLT_DATA_CH8);
            break;

        case TOUCH_CHANNEL_9:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_FLT_DATA_9);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_FLT_DATA_CH9);
            break;

        case TOUCH_CHANNEL_10:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_FLT_DATA_10);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_FLT_DATA_CH10);
            break;

